Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Additional Bootstrap Servers
fr: Serveurs Bootstrap supplémentaires
ko: 추가 부트스트랩 서버
tr: Ek Bootstrap Sunucuları
vi: Máy chủ bootstrap bổ sung
zh_hans: 额外的 Bootstrap 服务器
zh_hant: 額外的 Bootstrap 伺服器

source: Search or type a field path…
fr: Recherchez ou tapez un chemin de champ...
ko: 검색하거나 필드 경로를 입력하십시오…
tr: Arayın veya bir alan yolu yazın…
vi: Tìm kiếm hoặc nhập đường dẫn trường…
zh_hans: 搜索或输入字段路径…
zh_hant: 搜尋或輸入欄位路徑…

source: The plugin's executable couldn't be loaded. It may be damaged or improperly signed.
fr: Le programme exécutable du plugin n'a pas pu être chargé. Il peut être endommagé ou mal signé.
ko: 플러그인의 실행 파일을 불러올 수 없습니다. 파일이 손상되었거나 올바르게 서명되지 않았을 수 있습니다.
tr: Eklentinin çalıştırılabilir dosyası yüklenemedi. Hasarlı veya hatalı imzalanmış olabilir.
vi: Không thể tải tệp thực thi của plugin. Có thể tệp bị hỏng hoặc ký không đúng.
zh_hans: 无法加载插件的可执行文件。它可能已损坏或签名不正确。
zh_hant: 無法載入外掛的執行檔。它可能已損壞或簽章不正確。

source: A sync is still running
fr: Une synchronisation est toujours en cours.
ko: 동기화가 아직 실행 중입니다
tr: Bir eşitleme hâlâ çalışıyor
vi: Vẫn còn một phiên đồng bộ đang chạy
zh_hans: 同步仍在运行
zh_hant: 同步仍在執行

source: Connection Test Failed
fr: Test de connexion échoué
ko: 연결 테스트 실패
tr: Bağlantı Testi Başarısız
vi: Kiểm tra kết nối thất bại
zh_hans: 连接测试失败
zh_hant: 連線測試失敗

source: NULL display:
fr: Affichage NULL :
ko: NULL 표시:
tr: NULL görünümü:
vi: Hiển thị NULL:
zh_hans: NULL 显示：
zh_hant: NULL 顯示：

source: No tables selected for export
fr: Aucune table sélectionnée pour l'exportation
ko: 내보낼 테이블이 선택되지 않음
tr: Dışa aktarma için tablo seçilmedi
vi: Không có bảng nào được chọn để xuất
zh_hans: 未选择要导出的表
zh_hant: 未選取要匯出的資料表

source: Showing %1$lld of %2$lld
fr: Affichage de %1$lld de %2$lld
ko: 전체 %2$lld개 중 %1$lld개 표시
tr: %2$lld öğeden %1$lld tanesi gösteriliyor
vi: Đang hiển thị %1$lld trên %2$lld
zh_hans: 正在显示 %2$lld 中的 %1$lld 项
zh_hant: 正在顯示 %2$lld 中的 %1$lld 項

source: Could not attach %1$d files. %2$@
fr: Impossible d'attacher les fichiers %1$d. %2$@

source: Showing or hiding columns will reload data and discard all unsaved changes.
fr: L'affichage ou le masquage des colonnes rechargeront les données et rejeteront toutes les modifications non enregistrées.

source: Create New View...
fr: Créer une nouvelle vue...
ko: 새 뷰 생성...
tr: Yeni Görünüm Oluştur...
vi: Tạo view mới...
zh_hans: 创建新视图...
zh_hant: 建立新檢視表...

source: %1$d of %2$d allowed for this run
fr: %1$d de %2$d autorisés pour cette exécution
ko: %2$d개 중 %1$d개를 이번 실행에서 허용함
tr: bu çalıştırma için %1$d / %2$d izin verildi
vi: %1$d trên %2$d được cho phép trong lần chạy này
zh_hans: 本次运行已允许 %1$d / %2$d
zh_hant: 本次執行已允許 %1$d / %2$d

source: Clear Filters
fr: Effacer les filtres
ko: 필터 지우기
tr: Filtreleri Temizle
vi: Xóa bộ lọc
zh_hans: 清除筛选
zh_hant: 清除篩選

source: Move Up
fr: Avancer
ko: 위로 이동
tr: Yukarı Taşı
vi: Di chuyển lên
zh_hans: 上移
zh_hant: 上移

source: Matched name
fr: Nom correspondant
ko: 일치한 이름
tr: Eşleşen ad
vi: Tên đã khớp
zh_hans: 匹配到的名称
zh_hant: 符合的名稱

source: Purchase License
fr: Achat de licence
ko: 라이선스 구매
tr: Lisans Satın Al
vi: Mua giấy phép
zh_hans: 购买许可证
zh_hant: 購買授權

source: No Statements Yet
fr: Pas encore de déclarations

source: Sync paused — Pro license expired
fr: Synchronisation suspendue - Licence Pro expirée
ko: 동기화 일시 중지 — Pro 라이선스 만료
vi: Tạm dừng đồng bộ — giấy phép Pro đã hết hạn
zh_hans: 同步已暂停 - Pro 许可证已过期
zh_hant: 同步已暫停，Pro 授權已過期

source: Favorites
fr: Favoris
ko: 즐겨찾기
tr: Sık Kullanılanlar
vi: Yêu thích
zh_hans: 收藏
zh_hant: 我的最愛

source: Next Tab (Alt)
fr: Fichier suivant (Alt)
ko: 다음 탭 (Alt)
vi: Tab tiếp theo (Alt)
zh_hans: 下一个标签页 (Alt)
zh_hant: 下一個分頁 (Alt)

source: License not verified in 30 days. Connect to the internet to check it.
fr: La licence n'a pas été vérifiée dans les 30 jours. Connectez-vous à Internet pour la vérifier.
ko: 30일 동안 라이선스를 확인하지 못했습니다. 인터넷에 연결해 확인하십시오.
tr: Lisans 30 gündür doğrulanmadı. Denetlemek için internete bağlanın.
vi: Giấy phép chưa được xác minh trong 30 ngày. Hãy kết nối internet để kiểm tra.
zh_hans: 许可证已有 30 天未验证。请连接互联网进行检查。
zh_hant: 授權已有 30 天未驗證。請連線到網際網路進行檢查。

source: -- Copy rows into %@
fr: -- Copier les lignes vers %@

source: Model name
fr: Nom du modèle
ko: 모델 이름
tr: Model adı
vi: Tên model
zh_hans: 模型名称
zh_hant: 模型名稱

source: No Selection
fr: Aucune sélection
ko: 선택 항목 없음
tr: Seçim Yok
vi: Chưa chọn
zh_hans: 未选择
zh_hant: 未選取

source: Backup finished
fr: Sauvegarde terminée
ko: 백업 완료
tr: Yedekleme bitti
vi: Sao lưu xong
zh_hans: 备份完成
zh_hant: 備份完成

source: Maximum rows to return (default 500, max 10000)
fr: Nombre maximum de lignes à retourner (par défaut 500, max 10000)
ko: 반환할 최대 행 수(기본값 500, 최대 10000)
tr: Döndürülecek maksimum satır sayısı (varsayılan 500, en çok 10000)
vi: Số hàng tối đa trả về (mặc định 500, tối đa 10000)
zh_hans: 返回行数上限（默认 500，最大 10000）
zh_hant: 回傳列數上限（預設 500，最大 10000）

source: The %@ plugin is not installed. You can download it from the plugin marketplace.
fr: Le plugin %@ n'est pas installé. Vous pouvez le télécharger depuis le marché des plugins.
ko: %@ 플러그인이 설치되어 있지 않습니다. 플러그인 마켓플레이스에서 다운로드할 수 있습니다.
tr: The %@ plugin is not installed. You can indirme it from the plugin marketplace.
vi: Plugin %@ chưa được cài đặt. Bạn có thể tải về từ chợ plugin.
zh_hans: %@ 插件未安装。您可以从插件市场下载。
zh_hant: 尚未安裝 %@ 外掛。你可以從外掛市集下載。

source: The change could not be applied: %@
fr: Le changement ne pouvait pas être appliqué : %@

source: List Grants
fr: Liste des subventions
ko: 부여 권한 목록
tr: Yetkileri Listele
vi: Liệt kê quyền được cấp
zh_hans: 列出授权
zh_hant: 列出授權

source: Changes saved
fr: Modifications enregistrées
ko: 변경 사항 저장됨
tr: Değişiklikler kaydedildi
vi: Đã lưu thay đổi
zh_hans: 更改已保存
zh_hant: 變更已儲存

source: Run Statement and Advance
fr: Exécuter l'affirmation et avancer
ko: 문 실행 후 다음으로
tr: İfadeyi Çalıştır ve İlerle
vi: Chạy câu lệnh rồi chuyển tiếp
zh_hans: 运行语句并前进
zh_hant: 執行陳述式並前進

source: Title Case
fr: Majuscules du titre

source: Failed after %@
fr: Échec après %@
ko: %@ 후 실패
tr: %@ sonra başarısız oldu
vi: Thất bại sau %@
zh_hans: %@ 后失败
zh_hant: %@ 後失敗

source: No Query History Yet
fr: Pas encore d'historique de requêtes
ko: 아직 쿼리 기록 없음
vi: Chưa có lịch sử truy vấn
zh_hans: 暂无查询历史
zh_hant: 尚無查詢記錄

source: Choose a connection. Its import sheet opens with the rows of this file, unsaved edits included.
fr: Choisissez une connexion. Sa feuille d'importation s'ouvre avec les lignes de ce fichier, y compris les modifications non enregistrées.

source: This database type signs in with the username and password above.
fr: Ce type de base de données se connecte avec le nom d'utilisateur et le mot de passe ci-dessus.

source: Potentially Dangerous Query
fr: Requête potentiellement dangereuse
ko: 잠재적으로 위험한 쿼리
vi: Truy vấn có thể nguy hiểm
zh_hans: 潜在危险查询
zh_hant: 潛在危險查詢

source: Index proposal on %@
fr: Proposition d'index sur %@
ko: %@에 대한 인덱스 제안
tr: %@ üzerinde indeks önerisi
vi: Đề xuất chỉ mục trên %@
zh_hans: 针对 %@ 的索引建议
zh_hant: 針對 %@ 的索引建議

source: Keep Open
fr: Gardez ouvert
ko: 계속 열어 두기
tr: Açık Tut
vi: Giữ mở
zh_hans: 保持打开
zh_hant: 保持開啟

source: Include Credentials
fr: Inclure les informations d'identification
ko: 자격 증명 포함
tr: Kimlik Bilgilerini Dahil Et
vi: Bao gồm Thông tin Đăng nhập
zh_hans: 包含凭据
zh_hant: 包含認證資訊

source: Keyboard
fr: Clavier
ko: 키보드
tr: Klavye
vi: Bàn phím
zh_hans: 键盘
zh_hant: 鍵盤

source: Name of the database or schema
fr: Nom de la base de données ou du schéma
ko: 데이터베이스 또는 스키마 이름
tr: Veritabanının veya şemanın adı
vi: Tên của cơ sở dữ liệu hoặc schema
zh_hans: 数据库或 Schema 的名称
zh_hant: 資料庫或綱要的名稱

source: %@ downloads
fr: %@ téléchargements
ko: %@회 다운로드
tr: %@ indirme
vi: %@ lượt tải
zh_hans: %@ 次下载
zh_hant: %@ 次下載

source: Enter this code on GitHub:
fr: Entrez ce code sur GitHub :
ko: GitHub에 다음 코드를 입력하십시오:
tr: Bu kodu GitHub'a girin:
vi: Nhập mã này trên GitHub:
zh_hans: 在 GitHub 上输入此代码：
zh_hant: 在 GitHub 上輸入此代碼：

source: Read-only connection
fr: Connexion en lecture seule
ko: 읽기 전용 연결
vi: Kết nối chỉ đọc
zh_hans: 只读连接
zh_hant: 唯讀連線

source: Switching to database '%@' timed out.
fr: Le changement vers la base de données '%@' a échoué en raison d'une durée d'attente dépassée
ko: 데이터베이스 '%@' 전환 시간이 초과되었습니다.
tr: '%@' veritabanına geçiş zaman aşımına uğradı.
vi: Chuyển sang cơ sở dữ liệu '%@' đã hết thời gian chờ.
zh_hans: 切换到数据库 '%@' 超时。
zh_hant: 切換到資料庫 '%@' 已逾時。

source: Truncated — read only
fr: Truncé - lecture seule
ko: 잘림 — 읽기 전용
tr: Kısaltıldı - salt okunur
vi: Đã cắt bớt — chỉ đọc
zh_hans: 已截断 - 只读
zh_hant: 已截斷，唯讀

source: Count Rows
fr: Comptage des lignes
ko: 행 수 세기
tr: Satırları Say
vi: Đếm dòng
zh_hans: 统计行数
zh_hant: 統計列數

source: Name the one you want under File > Import > Import Data From: %@.
fr: Nommez celui que vous voulez sous Fichier > Importation > Importation de données à partir de : %@.

source: Not signed in
fr: Pas connecté
ko: 로그인되지 않음
tr: Oturum açılmamış
vi: Chưa đăng nhập
zh_hans: 未登录
zh_hant: 未登入

source: v%@ available
fr: v%@ disponible
ko: v%@ 사용 가능
tr: v%@ mevcut
vi: Đã có v%@
zh_hans: v%@ 可用
zh_hant: v%@ 可用

source: Database
fr: Base de données
ko: 데이터베이스
tr: Veritabanı
vi: Cơ sở dữ liệu
zh_hans: 数据库
zh_hant: 資料庫

source: Cap user query results at the configured row count
fr: Résultats de la requête utilisateur de limitation à la contrainte de nombre de lignes configurée.
ko: 사용자 쿼리 결과를 설정된 행 수로 제한
tr: Kullanıcı sorgu sonuçlarını ayarlanan satır sayısıyla sınırla
vi: Giới hạn kết quả truy vấn theo số hàng đã cấu hình
zh_hans: 将用户查询结果限制在配置的行数内
zh_hant: 將使用者查詢結果限制在設定的列數內

source: Deselect All
fr: Désélectionner tout
ko: 전체 선택 해제
tr: Tümünü Bırak
vi: Bỏ chọn tất cả
zh_hans: 取消全选
zh_hant: 取消全選

source: Line Number
fr: Numéro de ligne
ko: 줄 번호
tr: Satır Numarası
vi: Số dòng
zh_hans: 行号
zh_hant: 行號

source: Table name '%@' may only contain letters, digits, underscore, and '.'.
fr: Le nom de la table '%@' ne peut contenir que des lettres, des chiffres, des tirets bas et des points.
ko: 테이블 이름 '%@'에는 문자, 숫자, 밑줄, '.'만 사용할 수 있습니다.
tr: '%@' tablo adı yalnızca harf, rakam, alt çizgi ve '.' içerebilir.
vi: Tên bảng '%@' chỉ được chứa chữ cái, chữ số, dấu gạch dưới và '.'.
zh_hans: 表名 '%@' 只能包含字母、数字、下划线和 '.'。
zh_hant: 資料表名稱 '%@' 只能包含字母、數字、底線和 '.'。

source: Always for this connection
fr: Toujours pour cette connexion
ko: 이 연결에서 항상
tr: Bu bağlantı için her zaman
vi: Luôn với kết nối này
zh_hans: 始终用于此连接
zh_hant: 一律用於這個連線

source: Copy finished with errors
fr: Copie terminée avec des erreurs

source: Copy TablePro Link
fr: Copier le lien de TablePro
ko: TablePro 링크 복사
tr: TablePro Bağlantısını Kopyala
vi: Sao chép liên kết TablePro
zh_hans: 复制 TablePro 链接
zh_hant: 複製 TablePro 連結

source: Rate limited
fr: Taux limité
ko: 요청 한도 초과
tr: Hız sınırı aşıldı
vi: Bị giới hạn tốc độ
zh_hans: 已限流
zh_hant: 已達速率限制

source: Disabled
fr: Handicapé
ko: 비활성화됨
tr: Devre Dışı
vi: Đã tắt
zh_hans: 已禁用
zh_hant: 已停用

source: %lld connection(s) use this profile. They keep this configuration as their own SSH tunnel.
fr: %lld connexion(s) utilisent ce profil. Ils conservent cette configuration comme leur propre tunnel SSH.

source: Collapse All
fr: Collapse tout
ko: 모두 축소
tr: Tümünü Daralt
vi: Thu gọn tất cả
zh_hans: 全部折叠
zh_hant: 全部收合

source: Copy Image
fr: Copier l'image

source: Show All %@
fr: Afficher tout %@
ko: %@ 모두 보기
tr: Tüm %@ Göster
vi: Hiển thị tất cả %@
zh_hans: 显示全部%@
zh_hant: 顯示全部 %@

source: Regenerate
fr: Régénérer
ko: 다시 생성
vi: Tạo lại
zh_hans: 重新生成
zh_hant: 重新產生

source: No Queries Yet
fr: Pas encore de requêtes
ko: 아직 쿼리 없음
tr: Henüz Sorgu Yok
vi: Chưa có truy vấn
zh_hans: 还没有查询
zh_hant: 還沒有查詢

source: Filter keys or values…
fr: Filtre les clés ou les valeurs...
ko: 키 또는 값 필터링…
tr: Anahtar veya değerleri filtrele…
vi: Lọc khoá hoặc giá trị…
zh_hans: 筛选键或值…
zh_hant: 篩選鍵或值…

source: A sync conflict was detected and needs to be resolved.
fr: Un conflit de synchronisation a été détecté et doit être résolu.
ko: 동기화 충돌이 감지되어 해결이 필요합니다.
tr: Bir eşitleme çakışması tespit edildi ve çözülmesi gerekiyor.
vi: Phát hiện xung đột đồng bộ và cần được giải quyết.
zh_hans: 检测到同步冲突，需要解决。
zh_hant: 偵測到同步衝突，需要解決。

source: A row the filter hides holds %@ in column “%@”, which %@ cannot store. Clear the filter to find it, or choose Save As and pick UTF-8.
fr: Une ligne que le filtre cache contient %@ dans la colonne "%@", que %@ ne peut pas stocker. Effacez le filtre pour le trouver, ou choisissez Enregistrer sous et sélectionnez UTF-8.

source: No results for "%@".
fr: Aucun résultat pour "%@".

source: Google sign-in finished. Test the connection again.
fr: La connexion à Google est terminée. Veuillez réessayer la connexion.

source: Remove image
fr: Supprimer l'image
ko: 이미지 제거
tr: Görseli kaldır
vi: Gỡ hình ảnh
zh_hans: 移除图像
zh_hant: 移除圖片

source: TOTP Secret
fr: Secret TOTP
ko: TOTP 비밀 키
vi: Mã bí mật TOTP
zh_hans: TOTP 密钥
zh_hant: TOTP 金鑰

source: This driver has no TLS fallback. Preferred forces TLS, same as Required.
fr: Ce pilote n'a pas de fallback TLS. Les forces préférées imposent le TLS, tout comme le requis.
ko: 이 드라이버에는 TLS 대체 옵션이 없습니다. 선호는 필수와 동일하게 TLS 연결을 강제합니다.
tr: Bu sürücünün TLS yedeği yok. Preferred, Required ile aynı şekilde TLS'yi zorunlu kılar.
vi: Driver này không có phương án dự phòng TLS. Preferred buộc dùng TLS, giống Required.
zh_hans: 此驱动没有 TLS 回退。“首选”会强制使用 TLS，与“必需”相同。
zh_hant: 此驅動程式沒有 TLS 回退機制。「偏好」會強制使用 TLS，與「必要」相同。

source: Remove Duplicates
fr: Supprimer les doublons

source: Current Version
fr: Version actuelle

source: Run one statement. Reads need tools:read; anything that writes needs tools:write and is subject to the connection's Safe Mode, which asks the user to approve it. DROP and TRUNCATE go through confirm_destructive_operation instead. Statements that read or write files, or run server-side code, are refused. Send one statement per call.
fr: Exécutez une instruction. Les lectures nécessitent des outils :read ; tout ce qui écrit nécessite des outils :write et est soumis au mode sûr de la connexion, qui demande à l'utilisateur de l'approuver. DROP et TRUNCATE passent plutôt par confirm_destructive_operation. Les instructions qui lisent ou écrivent des fichiers, ou exécutent du code côté serveur, sont refusées. Envoyez une instruction par appel.
ko: 명령문 하나를 실행합니다. 읽기에는 tools:read가 필요하고, 쓰기에는 tools:write가 필요하며 연결의 안전 모드가 적용되어 사용자에게 승인을 요청합니다. DROP과 TRUNCATE는 대신 confirm_destructive_operation을 거칩니다. 파일을 읽거나 쓰거나 서버 측 코드를 실행하는 명령문은 거부됩니다. 호출당 명령문 하나만 보내십시오.
tr: Tek bir ifade çalıştırır. Okumalar tools:read gerektirir; yazan her şey tools:write gerektirir ve kullanıcıdan onay isteyen bağlantının Güvenli Modu'na tabidir. DROP ve TRUNCATE bunun yerine confirm_destructive_operation üzerinden gider. Dosya okuyan veya yazan ya da sunucu tarafında kod çalıştıran ifadeler reddedilir. Çağrı başına tek ifade gönderin.
vi: Chạy một câu lệnh. Thao tác đọc cần tools:read; bất cứ thao tác ghi nào cũng cần tools:write và phải tuân theo Chế độ an toàn của kết nối, vốn sẽ hỏi người dùng phê duyệt. DROP và TRUNCATE thì đi qua confirm_destructive_operation. Các câu lệnh đọc hoặc ghi tệp, hoặc chạy mã phía máy chủ, sẽ bị từ chối. Mỗi lần gọi chỉ gửi một câu lệnh.
zh_hans: 运行一条语句。读取需要 tools:read；任何写入都需要 tools:write，并受该连接安全模式的约束，会请求用户批准。DROP 和 TRUNCATE 改走 confirm_destructive_operation。读写文件或运行服务端代码的语句会被拒绝。每次调用只发送一条语句。
zh_hant: 執行一條陳述式。讀取需要 tools:read；任何寫入都需要 tools:write，並受該連線安全模式的約束，會請求使用者核准。DROP 和 TRUNCATE 改走 confirm_destructive_operation。讀寫檔案或執行伺服器端程式碼的陳述式會被拒絕。每次呼叫只傳送一條陳述式。

source: Download cloud-sql-proxy…
fr: Télécharger cloud-sql-proxy...
ko: cloud-sql-proxy 다운로드…
tr: cloud-sql-proxy indir…
vi: Tải cloud-sql-proxy…
zh_hans: 下载 cloud-sql-proxy…
zh_hant: 下載 cloud-sql-proxy…

source: Only the first %lld lines are shown.
fr: Seules les premières %lld lignes sont affichées.

source: Remove
fr: Enlever
ko: 제거
tr: Kaldır
vi: Gỡ
zh_hans: 移除
zh_hant: 移除

source: Save frequently used queries, or link a folder of .sql files to share with your team.
fr: Enregistrez les requêtes fréquemment utilisées ou associez un dossier de fichiers .sql à partager avec votre équipe.
ko: 자주 사용하는 쿼리를 저장하거나 .sql 파일 폴더를 연결하여 팀과 공유하십시오.
tr: Sık kullanılan sorguları kaydedin veya ekibinizle paylaşmak için bir .sql dosyaları klasörü bağlayın.
vi: Lưu các truy vấn thường dùng, hoặc liên kết một thư mục chứa file .sql để chia sẻ với nhóm của bạn.
zh_hans: 保存常用查询，或链接包含 .sql 文件的文件夹以与团队共享。
zh_hant: 儲存常用查詢，或連結包含 .sql 檔案的資料夾以與你的團隊共用。

source: The API key will be permanently deleted.
fr: La clé API sera supprimée définitivement.
ko: API 키가 영구적으로 삭제됩니다.
tr: API anahtarı kalıcı olarak silinecek.
vi: API key sẽ bị xóa vĩnh viễn.
zh_hans: API 密钥将被永久删除。
zh_hant: API 金鑰將被永久刪除。

source: JSON Key
fr: Clé JSON

source: %@ or more
fr: %@ ou plus
ko: %@ 이상
tr: %@ veya daha fazla
vi: %@ trở lên
zh_hans: %@ 或更多
zh_hant: %@ 或更多

source: Publish Saved Queries to Team…
fr: Publier les requêtes enregistrées sur l'équipe...
ko: 저장된 쿼리를 팀에 게시…
tr: Kayıtlı Sorguları Takıma Yayınla…
vi: Xuất bản truy vấn đã lưu cho nhóm…
zh_hans: 将已保存的查询发布到团队…
zh_hant: 將已儲存的查詢發佈到團隊…

# Foreign key %@ matches %@ on the target but the names differ.
source: Foreign key %1$@ matches %2$@ on the target but the names differ.
fr: La clé étrangère %1$@ correspond à %2$@ sur la cible, mais les noms diffèrent.
ko: 외래 키 %@은(는) 대상의 %@과(와) 일치하지만 이름이 다릅니다.
tr: %1$@ yabancı anahtarı hedefteki %2$@ ile eşleşiyor ama adları farklı.
vi: Khóa ngoại %1$@ khớp với %2$@ trên đích nhưng tên khác nhau.
zh_hans: 外键 %1$@ 与目标上的 %2$@ 相同，但名称不同。
zh_hant: 外鍵 %1$@ 與目標上的 %2$@ 相同，但名稱不同。

source: This version matches %@.
fr: Cette version correspond à %@.

source: Excel spreadsheet with formatting support.
fr: Fichier Excel avec prise en charge de la mise en forme.
ko: 서식을 지원하는 Excel 스프레드시트입니다.
tr: Biçimlendirme destekli Excel elektronik tablosu.
vi: Bảng tính Excel có hỗ trợ định dạng.
zh_hans: 支持格式化的 Excel 电子表格。
zh_hant: 支援格式設定的 Excel 試算表。

source: Syncs passwords via iCloud Keychain (end-to-end encrypted).
fr: Synchronise les mots de passe via l'anneau de clés iCloud (encrypté de bout en bout).
ko: iCloud 키체인을 통해 암호를 동기화합니다(종단 간 암호화).
tr: Parolaları iCloud Keychain ile senkronize eder (uçtan uca şifreli).
vi: Đồng bộ mật khẩu qua iCloud Keychain (mã hoá đầu cuối).
zh_hans: 通过 iCloud 钥匙串同步密码（端到端加密）。
zh_hant: 透過 iCloud 鑰匙圈同步密碼（端對端加密）。

source: At their declared lengths the columns pass InnoDB's 8,126-byte record limit, so this one is %@, which does not enforce a length.
fr: À leurs longueurs déclarées, les colonnes dépassent la limite de enregistrement de 8 126 octets d'InnoDB, donc celle-ci est %@, ce qui ne force pas de longueur.

source: CA certificate not found: %@
fr: Certificat CA non trouvé : %@
ko: CA 인증서를 찾을 수 없습니다: %@
tr: CA sertifikası bulunamadı: %@
vi: Không tìm thấy chứng chỉ CA: %@
zh_hans: 未找到CA证书：%@
zh_hant: 找不到 CA 憑證：%@

source: No databases
fr: Pas de bases de données
ko: 데이터베이스 없음
tr: Veritabanı yok
vi: Không có cơ sở dữ liệu
zh_hans: 没有数据库
zh_hant: 沒有資料庫

source: The assistant answers once the connection is up
fr: L'assistant répond une fois la connexion établie.

source: Allowing a statement applies to this run only. It is never saved.
fr: L'autorisation d'une déclaration s'applique uniquement à cette exécution. Elle n'est jamais enregistrée.
ko: 구문 허용은 이번 실행에만 적용되며 저장되지 않습니다.
tr: Bir ifadeye izin vermek yalnızca bu çalıştırma için geçerlidir. Asla kaydedilmez.
vi: Việc cho phép một câu lệnh chỉ áp dụng cho lần chạy này. Nó không bao giờ được lưu.
zh_hans: 允许某条语句仅对本次运行有效，永远不会被保存。
zh_hant: 允許某條陳述式僅對本次執行有效，永遠不會被儲存。

source: Save Filter Preset
fr: Enregistrer le paramètre de filtre par défaut
ko: 필터 프리셋 저장
tr: Filtre Ön Ayarını Kaydet
vi: Lưu mẫu bộ lọc
zh_hans: 保存筛选预设
zh_hant: 儲存篩選預設集

source: Saved password
fr: Mot de passe sauvegardé

source: Show invisible characters
fr: Afficher des caractères invisibles
ko: 보이지 않는 문자 표시
tr: Görünmez karakterleri göster
vi: Hiển thị ký tự ẩn
zh_hans: 显示不可见字符
zh_hant: 顯示不可見字元

source: Invalid argument: %@
fr: Argument invalide : %@
ko: 잘못된 인수: %@
tr: Geçersiz bağımsız değişken: %@
vi: Đối số không hợp lệ: %@
zh_hans: 无效的参数: %@
zh_hant: 無效的引數：%@

source: Database Index
fr: Index de la base de données
ko: 데이터베이스 인덱스
tr: Veritabanı İndeksi
vi: Chỉ mục cơ sở dữ liệu
zh_hans: 数据库索引
zh_hant: 資料庫索引

source: SSH Host
fr: Serveur SSH
ko: SSH 호스트
vi: Máy chủ SSH
zh_hans: SSH 主机
zh_hant: SSH 主機

source: Format Query (⌥⌘F)
fr: Requête de formatage (⌥⌘F)
ko: 쿼리 서식 지정 (⌥⌘F)
tr: Sorguyu Biçimlendir (⌥⌘F)
vi: Định dạng truy vấn (⌥⌘F)
zh_hans: 格式化查询 (⌥⌘F)
zh_hant: 格式化查詢 (⌥⌘F)

source: These changes drop %@, the account this connection uses.
fr: Ces changements réduisent %@, le compte utilisé par cette connexion.
ko: 이 변경 사항은 이 연결에서 사용하는 계정 %@을(를) 삭제합니다.
tr: Bu değişiklikler, bu bağlantının kullandığı hesap olan %@ hesabını siler.
vi: Các thay đổi này xoá %@, tài khoản mà kết nối này đang dùng.
zh_hans: 这些更改会删除 %@，也就是此连接使用的账户。
zh_hant: 這些變更會刪除 %@，也就是此連線使用的帳號。

source: Referenced schema
fr: Schéma référencé
ko: 참조된 스키마
tr: Başvurulan şema
vi: Schema được tham chiếu
zh_hans: 被引用的 Schema
zh_hant: 被參照的綱要

source: Reassign
fr: Réattribuer
ko: 재할당
tr: Yeniden Ata
vi: Gán lại
zh_hans: 重新分配
zh_hant: 重新指派

source: The first call asks. The answer is remembered for that client until you revoke it.
fr: La première appel demande. La réponse est mémorisée pour ce client jusqu'à ce que vous la révoquez.

source: SSH Tunnel: %@
fr: Tunnel SSH : %@

# Import failed at line %lld: %@
source: Import failed at line %1$lld: %2$@
fr: Importation échouée à la ligne %1$lld : %2$@
ko: 줄 %1$lld에서 가져오기에 실패했습니다: %2$@
tr: Satır %lld'de içe aktarma başarısız: %@
vi: Nhập thất bại tại dòng %1$lld: %2$@
zh_hans: 在第 %lld 行导入失败: %@
zh_hant: 在第 %1$lld 行匯入失敗：%2$@

source: Unable to Load Privileges
fr: Impossible de charger les privilèges
ko: 권한을 불러올 수 없음
tr: Yetkiler Yüklenemedi
vi: Không tải được quyền
zh_hans: 无法加载权限
zh_hant: 無法載入權限

source: The server has no MCP endpoint at that address.
fr: Le serveur n'a pas d'extrémité MCP à cette adresse.

source: color %@
fr: Couleur %@
ko: 색상 %@
tr: renk %@
vi: màu %@
zh_hans: 颜色 %@
zh_hant: 顏色 %@

source: 1 duplicate row
fr: 1 ligne répétée

source: Two columns are both named “%@”. Rename one, then save again.
fr: Deux colonnes portent le même nom "%@". Renommez-en une, puis enregistrez à nouveau.

source: Size:
fr: Taille :
ko: 크기:
vi: Kích thước:
zh_hans: 大小：
zh_hant: 大小：

source: New Jump Host
fr: Nouveau hôte de saut
ko: 새 점프 호스트
tr: Yeni Atlama Sunucusu
vi: Jump Host mới
zh_hans: 新建 Jump Host
zh_hant: 新增 Jump Host

source: The Oracle server closed the connection during the login handshake.
fr: Le serveur Oracle a fermé la connexion pendant la poignée de main de connexion.
ko: Oracle 서버가 로그인 핸드셰이크 중 연결을 종료했습니다.
tr: Oracle sunucusu oturum açma el sıkışması sırasında bağlantıyı kapattı.
vi: Máy chủ Oracle đã đóng kết nối trong quá trình bắt tay đăng nhập.
zh_hans: Oracle 服务器在登录握手期间关闭了连接。
zh_hant: Oracle 伺服器在登入交握期間關閉了連線。

source: Operator
fr: Opérateur
ko: 연산자
vi: Toán tử
zh_hans: 运算符
zh_hant: 運算子

source: Not valid JSON
fr: JSON non valide

source: Cloud Storage URI
fr: URI de stockage en nuage

source: No Saved Connections
fr: Aucune connexion enregistrée
ko: 저장된 연결 없음
tr: Kayıtlı Bağlantı Yok
vi: Không có kết nối đã lưu
zh_hans: 没有已保存的连接
zh_hant: 沒有已儲存的連線

source: List of all saved database connections with metadata
fr: Liste de toutes les connexions de base de données enregistrées avec des métadonnées
ko: 메타데이터가 포함된 저장된 모든 데이터베이스 연결 목록
tr: Meta verileriyle birlikte kayıtlı tüm veritabanı bağlantılarının listesi
vi: Danh sách tất cả kết nối cơ sở dữ liệu đã lưu kèm metadata
zh_hans: 所有已保存数据库连接及其元数据的列表
zh_hant: 所有已儲存的資料庫連線及其中繼資料的清單

source: SSH host key verification failed
fr: Vérification de la clé d'hôte SSH échouée
ko: SSH 호스트 키 확인에 실패했습니다
tr: SSH sunucu anahtarı doğrulaması başarısız
vi: Xác minh khóa máy chủ SSH thất bại
zh_hans: SSH 主机密钥验证失败
zh_hant: SSH 主機金鑰驗證失敗
